## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.argocd_manager will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "argocd_manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = (known after apply)
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # argocd_cluster.gke will be created
+   resource "argocd_cluster" "gke" {
+       id     = (known after apply)
+       info   = (known after apply)
+       name   = "do-cinema"
+       server = "https://https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"

+       config {
+           bearer_token = (sensitive value)

+           tls_client_config {
+               ca_data = (sensitive)
            }
        }
    }

  # kubernetes_cluster_role.argocd_manager will be created
+   resource "kubernetes_cluster_role" "argocd_manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager-role"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "*",
            ]
+           resources  = [
+               "*",
            ]
+           verbs      = [
+               "*",
            ]
        }
+       rule {
+           non_resource_urls = [
+               "*",
            ]
+           verbs             = [
+               "*",
            ]
        }
    }

  # kubernetes_cluster_role_binding.argocd_manager will be created
+   resource "kubernetes_cluster_role_binding" "argocd_manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager-role-binding"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "argocd-manager-role"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-manager"
+           namespace = "kube-system"
        }
    }

  # kubernetes_service_account.argocd_manager will be created
+   resource "kubernetes_service_account" "argocd_manager" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
